Revit 2027 API
ExternalResourceLoadContext.GetCurrentlyLoadedReference Method
 Returns a copy of the ExternalResourceReference currently in use by the containing element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceReference GetCurrentlyLoadedReference()
Public Function GetCurrentlyLoadedReference As ExternalResourceReference
public:
ExternalResourceReference^ GetCurrentlyLoadedReference()
member GetCurrentlyLoadedReference : unit -> ExternalResourceReference
Return Value
ExternalResourceReference
 A copy of the ExternalResourceReference currently in use by the containing element.
Remarks
A server may use to wish this information to, for example, tell whether the Revit user was previously using their server or not.
This reference may be null if there is no current value. For example, a newly-created link being loaded for the first time would have no currently-loaded reference.
See Also
Reference
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace